//////////////////////////////////////////////////////////////
// Windows 의 콘솔 화면에서 커서 제어.
//
//////////////////////////////////////////////////////////////
#ifndef __CONSOLE__
#define __CONSOLE__

#define dfSCREEN_WIDTH		81		// 콘솔 가로 80칸 + NULL
#define dfSCREEN_HEIGHT		24		// 콘솔 세로 24칸


// 화면 깜빡임을 없애기 위한 화면 버퍼.
extern char szScreenBuffer[dfSCREEN_HEIGHT][dfSCREEN_WIDTH];

//타이틀 버퍼
extern char szTitleBuffer[20][20];


//-------------------------------------------------------------
// 콘솔 제어를 위한 준비 작업.
//
//-------------------------------------------------------------
void cs_Initial(void);


//-------------------------------------------------------------
// 콘솔 화면의 커서를 X, Y 좌표로 이동시킨다.
//
//-------------------------------------------------------------
//void cs_MoveCursor(int iPosX, int iPosY);
void gotoxy(int iPosX, int iPosY);
//-------------------------------------------------------------
// 콘솔 화면을 조기화 한다.
//
//-------------------------------------------------------------
void cs_ClearScreen(void);

// 버퍼의 내용을 화면으로 찍어주는 함수.
void Buffer_Flip(void);

// 화면 버퍼를 지워주는 함수
void Buffer_Clear(void);

#endif

